[
  {
    "title": "Améliorez l'interface d'un site mobile avec des animations CSS",
    "description": "Dans ce projet, j'ai travaillé sur l'interface mobile-first d'une start-up en utilisant Sass et en implémentant des animations CSS pour améliorer l'expérience utilisateur.",
    "skills": [
      "J'ai intégré une maquette en mobile-first",
      "J'ai mis en œuvre des animations CSS",
      "J'ai versionné mon projet avec Git et GitHub"
    ],
    "languages": ["Sass", "CSS", "Git", "GitHub"],
    "link": "https://github.com/dogukankzk/OpenClassroom_projet4.git"
  },
  {
    "title": "Créez une page web dynamique avec JavaScript",
    "description": "Ce projet m'a amené à créer une page web dynamique pour une architecte d'intérieur, en utilisant JavaScript et en communiquant avec une API pour afficher les données.",
    "skills": [
      "J'ai géré les événements utilisateurs avec JavaScript",
      "J'ai manipulé les éléments du DOM avec JavaScript",
      "J'ai récupéré les données utilisateurs via des formulaires"
    ],
    "languages": ["JavaScript", "API", "HTML", "CSS"],
    "link": "https://github.com/dogukankzk/Projet_6_OC.git"
  },
  {
    "title": "Créez une application web de location immobilière avec React",
    "description": "Dans ce projet, j'ai développé le front-end d'une application en utilisant React et React Router pour offrir une expérience utilisateur fluide et réactive.",
    "skills": [
      "J'ai initialisé une application avec Create React App",
      "J'ai configuré la navigation entre les pages avec React Router",
      "J'ai développé des composants React pour l'interface utilisateur",
      "J'ai mis en œuvre des animations CSS",
      "J'ai développé une interface web avec Sass"
    ],
    "languages": ["React", "React Router", "JavaScript", "Sass", "CSS"],
    "link": "https://github.com/dogukankzk/kasa_New.git"
  },
  {
    "title": "Implémentez le front-end d'une application bancaire avec React",
    "description": "Dans ce projet, j'ai travaillé sur le front-end d'une application bancaire en utilisant React et Redux pour créer une interface utilisateur dynamique et réactive, tout en intégrant des appels API.",
    "skills": [
      "J'ai affiché les données du back-end sur l'interface via des appels API",
      "J'ai configuré des routes API pour la communication client/serveur",
      "J'ai implémenté la gestion des données avec Redux pour assurer le bon fonctionnement du front-end"
    ],
    "languages": ["React", "Redux", "API", "Swagger", "JavaScript"],
    "link": "https://github.com/dogukankzk/P10_openclassroom.git"
  }
]
